#+PROPERTY: header-args:sage :session result

#+BEGIN_SRC sage :exports none
  from e8theta_degree3.hecke_module import (HalfIntMatElement, HeckeModule,
                                            spinor_l_euler_factor, rankin_convolution_degree1,
                                            from_spinor_to_standard_l)
  from e8theta_degree3.gl3_repn import gl3_repn_module
  from e8theta_degree3.results.data.data_utils import (data_dir, half_int_mat_to_list, sort_ts,
                                                       dict_sum, factor_latex, factorization_normalized,
                                                       vec_dict_gcd)

  T0 = HalfIntMatElement(matrix([[1, 1 / 2, 1 / 2], [1 / 2, 1, 1 / 2], [1 / 2, 1 / 2, 1]]))
  T1 = HalfIntMatElement(diagonal_matrix([1, 1, 1]))
  i = QuadraticField(-1, name="i").gen()
#+END_SRC

#+RESULTS:

* Polynomial representation
  The dimension of the polynomial representation of weight =(16, 13, 7)= is =154=.

  We sort SSYT of weight =(9, 6, 0)= as in [[file:SSYT.org][this file]].

* Basis of the space of cusp forms

#+BEGIN_SRC sage :exports none
  dcts16_13_7 = load(os.path.join(data_dir(), "wt16_13_7_dicts.sobj"))
  S16_13_7 = HeckeModule(dcts16_13_7, lin_indep_ts=[T0])
  ts16_13_7 = sort_ts(S16_13_7.basis[0].keys())
#+END_SRC

#+RESULTS:

Let =F1= and =F2= are theta series of weight =(16, 13, 7)= associated with the
following matrices respectively.
#+BEGIN_SRC sage :exports results
  mat0 = matrix(3, [-3, -i, 2, 4*i, -2, 0, 0, 0, 2, 4*i, -2, -4*i, 5, i,
                    0, 0, 5, -3*i, 6, -2*i, 1, 7*i, 0, 0])
  mat1 = matrix(3, [1, 3*i, -2, 0, -2, 0, 0, 0, -7, -5*i, 4, 2*i, 0,
                    -6*i, 0, 0, 5, 3*i, -1, -3*i, -1, 3*i, 0, 0])

  print mat0
  print ""
  print mat1
#+END_SRC

#+RESULTS:
: [  -3   -i    2  4*i   -2    0    0    0]
: [   2  4*i   -2 -4*i    5    i    0    0]
: [   5 -3*i    6 -2*i    1  7*i    0    0]
:
: [   1  3*i   -2    0   -2    0    0    0]
: [  -7 -5*i    4  2*i    0 -6*i    0    0]
: [   5  3*i   -1 -3*i   -1  3*i    0    0]

#+BEGIN_SRC sage :exports none
print latex(mat0)
print latex(mat1)
#+END_SRC

#+RESULTS:
#+begin_example
\left(\begin{array}{rrrrrrrr}
-3 & -\sqrt{-1} & 2 & 4 \sqrt{-1} & -2 & 0 & 0 & 0 \\
2 & 4 \sqrt{-1} & -2 & -4 \sqrt{-1} & 5 & \sqrt{-1} & 0 & 0 \\
5 & -3 \sqrt{-1} & 6 & -2 \sqrt{-1} & 1 & 7 \sqrt{-1} & 0 & 0
\end{array}\right)
\left(\begin{array}{rrrrrrrr}
1 & 3 \sqrt{-1} & -2 & 0 & -2 & 0 & 0 & 0 \\
-7 & -5 \sqrt{-1} & 4 & 2 \sqrt{-1} & 0 & -6 \sqrt{-1} & 0 & 0 \\
5 & 3 \sqrt{-1} & -1 & -3 \sqrt{-1} & -1 & 3 \sqrt{-1} & 0 & 0
\end{array}\right)
#+end_example


Then =F1= and =F2= span the space of cusp forms of weight =(16, 13, 7)=.

Fourier coefficients of =F1/35562240= are given in [[file:f1.csv][F1]].
# (progn (re-search-forward "|") (org-table-export "./f1.csv" "orgtbl-to-csv"))
#+BEGIN_SRC sage :results table  :exports none
  [(half_int_mat_to_list(t), S16_13_7.basis[0][t].vector/35562240) for t in ts16_13_7]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, 15190911172, 0, -15190911172, 0, 0, 0, 0, 0, 0, 7595455586, 7595455586, 0, 0, -7595455586, -7595455586, 0, 0, 0, 0, 0, 0, 0, 0, 11004590531, 10322763542, 0, 9640936553, 8764813140, -1363653978, 0, 1363653978, -8764813140, -9640936553, 0, -10322763542, -11004590531, 0, 0, 0, 0, 0, 0, 0, 0, 11004590531, 11686417520, 0, 11004590531, 11004590531, 13147219710, 0, 5161381771, 4382406570, 5843208760, -5843208760, -4382406570, -5161381771, 0, -13147219710, -11004590531, -11004590531, 0, -11686417520, -11004590531, 0, 0, 0, 0, 0, 0, -7595455586, 0, -9640936553, -10517059966, 0, -5161381771, -5940356972, -8180134363, 0, -2921604380, -2921604380, 0, -8180134363, -5940356972, -5161381771, 0, -10517059966, -9640936553, 0, -7595455586, 0, 0, -15190911172, -7595455586, -7595455586, 1363653978, 1363653978, 0, 5843208760, 1460802190, 2239777391, 8180134363, -8180134363, -2239777391, -1460802190, -5843208760, 0, -1363653978, -1363653978, 7595455586, 7595455586, 15190911172, 0, 0, 7595455586, -8764813140, 876123413, 10517059966, -13147219710, -2142629179, -2142629179, -13147219710, 10517059966, 876123413, -8764813140, 7595455586, 0, 0, 15190911172, 7595455586, 7595455586, 10322763542, -681826989, -11686417520, 11686417520, 681826989, -10322763542, -7595455586, -7595455586, -15190911172, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |
| [1, 1, 1, 0, 0, 0] | (0, 303818223440, 0, 0, 0, -303818223440, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 145691626152, 0, 0, 0, 1554371392, -189709988276, -264110172744, 0, 0, 0, 264110172744, 189709988276, -1554371392, 0, 0, 0, -145691626152, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 303818223440, 0, 0, 1554371392, 191264359668, 116864175200, 0, 0, 0, 0, 0, -245414767920, -245414767920, 0, 0, 0, 0, 0, 116864175200, 191264359668, 1554371392, 0, 0, 303818223440, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 264110172744, 74400184468, -116864175200, 0, 0, 0, 0, -116864175200, 74400184468, 264110172744, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -303818223440, 0, 0, -145691626152, -145691626152, 0, 0, -303818223440, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |
| [1, 1, 2, 0, 0, 0] | (0, -3645818681280, 0, 1093745604384, 0, 5468728021920, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1748299513824, 0, 0, 0, 528220345488, 1715571818352, 2426083097904, 0, 0, 0, -5174694140112, -3496599027648, -6502282623216, 0, 0, 0, 3515251484352, 5188941171360, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -3645818681280, 0, 0, 528220345488, -1187351472864, -476840193312, 0, 0, 0, 0, 0, 6317531287704, 6317531287704, 2327900011488, 0, 0, 0, 0, -14023185646560, -4251796424952, -10025602481832, 0, 0, -71336866363536, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1093745604384, 0, 0, -5174694140112, -1678095112464, -4683778708032, 0, 0, 0, 0, 14023185646560, 9771389221608, 15545195278488, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5468728021920, 0, 0, 3515251484352, -1673689687008, 0, 0, 71336866363536, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| [1, 1, 3, 1, 1, 1] | (0, 0, 1579854761888, 1458327472512, -1215272893760, 13368001831360, 71093464284960, 0, 0, 0, 0, 789927380944, 789927380944, 729163736256, 729163736256, -607636446880, -607636446880, 6684000915680, 6684000915680, 35546732142480, 35546732142480, 0, 0, 0, 0, 1144477415224, 1073567408368, 704293793984, 1354804298504, 1061103805152, -511093628096, -266484677952, -732329743200, -7516755286608, -6541227804256, 1838453054560, -15377742452848, 713333701536, 13251280816560, 5723092681616, 30604966611960, 157695401363760, 0, 0, 0, 0, 1144477415224, 1215387422080, 0, 1496624312216, 1496624312216, 1227073839600, 1056440690976, 704293793984, -100514643504, -794676391360, -1161604132616, -4389444189384, -6603574452416, -584320876000, -11639714798040, -13926280807240, -1709440229024, 2103555153600, -22762795455832, 232879584504, 19457240949000, 5242638564584, 91679301222600, 218769735974400, 0, 0, -789927380944, 704293793984, -650510504520, -944210997872, 1056440690976, 352146896992, -452661540496, -563308230128, 0, -2891279821816, -2891279821816, 4833399210784, 4968271620888, 1505535375408, 14190724368440, 17015108956240, 11715682691224, 27334563330896, 29647034156784, 30705638731904, 56927957358616, 121864127488008, -1579854761888, -789927380944, -60763644688, 511093628096, 244608950144, 710454015392, 1161604132616, -3227840056768, -1013709793736, 7219674045712, 4968271620888, 3462736245480, 16147925238512, 26008729643744, 0, 19557636944648, 19557636944648, 4800986468192, 12570065297744, 41611540995552, 1458327472512, 729163736256, 1336800183136, -7516755286608, -975527482352, 7404153376464, -11639714798040, 2286566009200, 14503406587416, 22907251783008, -11715682691224, 15618880639672, 13306409813784, 4800986468192, -7769078829552, 0, 1215272893760, 607636446880, 7291637362560, 15377742452848, 16091076154384, 3553129039360, 22762795455832, 22995675040336, 3771313675840, 30705638731904, -26222318626712, -41611540995552, 13368001831360, 6684000915680, -28862731226800, 5723092681616, -24881873930344, 5242638564584, -86436662658016, -121864127488008, -71093464284960, -35546732142480, -157695401363760, -218769735974400)                                                                                                                                                                                                                                                                                                       |
| [2, 2, 2, 2, 2, 2] | (-10134171912960, -291259065736704, 259949857541312, 0, -259949857541312, 291259065736704, 10134171912960, -5067085956480, -5067085956480, -145629532868352, -145629532868352, 129974928770656, 129974928770656, 0, 0, -129974928770656, -129974928770656, 145629532868352, 145629532868352, 5067085956480, 5067085956480, 5067085956480, 0, -142251475564032, -1689028652160, 556945597032656, 472227074841120, -200847017285632, 358210781788784, 543803981175936, -275832709108192, 0, 275832709108192, -543803981175936, -358210781788784, 200847017285632, -472227074841120, -556945597032656, 1689028652160, 142251475564032, 0, -5067085956480, 10134171912960, 5067085956480, -140562446911872, 1689028652160, 558634625684816, 643353147876352, 0, 529336854824016, 529336854824016, 815705971763904, -228455759494272, 155306962849360, 271901990587968, 478736528047616, -478736528047616, -271901990587968, -155306962849360, 228455759494272, -815705971763904, -529336854824016, -529336854824016, 0, -643353147876352, -558634625684816, -1689028652160, 140562446911872, -5067085956480, -10134171912960, -291259065736704, -145629532868352, -275604461639008, -200847017285632, -559057799074416, -373464599687264, -228455759494272, -383762722343632, -267167694605024, -357407204326064, 0, -171575719763584, -171575719763584, 0, -357407204326064, -267167694605024, -383762722343632, -228455759494272, -373464599687264, -559057799074416, -200847017285632, -275604461639008, -145629532868352, -291259065736704, -259949857541312, -129974928770656, -129974928770656, 275832709108192, 275832709108192, 0, 478736528047616, 206834537459648, 90239509721040, 357407204326064, -357407204326064, -90239509721040, -206834537459648, -478736528047616, 0, -275832709108192, -275832709108192, 129974928770656, 129974928770656, 259949857541312, 0, 0, 129974928770656, -543803981175936, -185593199387152, 373464599687264, -815705971763904, -286369116939888, -286369116939888, -815705971763904, 373464599687264, -185593199387152, -543803981175936, 129974928770656, 0, 0, 259949857541312, 129974928770656, 275604461639008, 472227074841120, -84718522191536, -643353147876352, 643353147876352, 84718522191536, -472227074841120, -275604461639008, -129974928770656, -259949857541312, 291259065736704, 145629532868352, 140562446911872, 142251475564032, 142251475564032, 140562446911872, 145629532868352, 291259065736704, -10134171912960, -5067085956480, 5067085956480, 10134171912960) |
| [1, 3, 3, 2, 0, 0] | (-524997890104320, -583330989004800, -1299855887165696, 0, 1299855887165696, 583330989004800, 524997890104320, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1972285065976320, 1252019535344640, 780986143990272, 2482164158601600, -1006610984910208, -1183563616856960, -848720081069568, -1401727443776384, -1246451285130240, 35896714745984, 0, -35896714745984, 1246451285130240, 1401727443776384, 848720081069568, 1183563616856960, 1006610984910208, -2482164158601600, -780986143990272, -1252019535344640, -1972285065976320, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1940130207995904, 4989617367928128, 5943710377671360, 1439769346714816, 3588279208263104, 2729461168438656, 1480736311786848, -810739971890592, -594755685110112, -1053899706574560, -395551849274752, -4040323036737664, -4040323036737664, -395551849274752, -1053899706574560, -594755685110112, -810739971890592, 1480736311786848, 2729461168438656, 3588279208263104, 1439769346714816, 5943710377671360, 4989617367928128, -1940130207995904, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16976906483465088, 5203968034988448, 898588829264928, -19325077681415424, -19115296668152704, -24908678923758976, -18733860253751136, -31653519902203424, -31653519902203424, -18733860253751136, -24908678923758976, -19115296668152704, -19325077681415424, 898588829264928, 5203968034988448, 16976906483465088, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 97809619305047424, 155064610466304032, 142518689640463712, 107782090813451264, 107782090813451264, 142518689640463712, 155064610466304032, 97809619305047424, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| [2, 2, 2, 0, 0, 0] | (0, -13009191721369856, 0, 0, 0, 13009191721369856, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15458323062835072, 0, 0, 0, 1641088148931072, -7932076474906304, -12543095374438272, 0, 0, 0, 12543095374438272, 7932076474906304, -1641088148931072, 0, 0, 0, -15458323062835072, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -13009191721369856, 0, 0, 1641088148931072, 9573164623837376, 4962145724305408, 0, 0, 0, 0, 0, -12941567668839936, -12941567668839936, 0, 0, 0, 0, 0, 4962145724305408, 9573164623837376, 1641088148931072, 0, 0, -13009191721369856, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12543095374438272, 4611018899531968, -4962145724305408, 0, 0, 0, 0, -4962145724305408, 4611018899531968, 12543095374438272, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13009191721369856, 0, 0, -15458323062835072, -15458323062835072, 0, 0, 13009191721369856, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |

Fourier coefficients of =F2/206391214080= are given in [[file:f2.csv][F2]].
# (progn (re-search-forward "|") (org-table-export "./f2.csv" "orgtbl-to-csv"))
#+BEGIN_SRC sage :results table  :exports none
  [(half_int_mat_to_list(t), S16_13_7.basis[1][t].vector/206391214080) for t in ts16_13_7]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, -569064, 0, 569064, 0, 0, 0, 0, 0, 0, -284532, -284532, 0, 0, 284532, 284532, 0, 0, 0, 0, 0, 0, 0, 0, -214922, -228844, 0, -242766, -150750, -27844, 0, 27844, 150750, 242766, 0, 228844, 214922, 0, 0, 0, 0, 0, 0, 0, 0, -214922, -201000, 0, -214922, -214922, -226125, 0, -114422, -75375, -100500, 100500, 75375, 114422, 0, 226125, 214922, 214922, 0, 201000, 214922, 0, 0, 0, 0, 0, 0, 284532, 0, 242766, 334782, 0, 114422, 153469, 217641, 0, 50250, 50250, 0, 217641, 153469, 114422, 0, 334782, 242766, 0, 284532, 0, 0, 569064, 284532, 284532, 27844, 27844, 0, -100500, -25125, -64172, -217641, 217641, 64172, 25125, 100500, 0, -27844, -27844, -284532, -284532, -569064, 0, 0, -284532, 150750, -92016, -334782, 226125, 11203, 11203, 226125, -334782, -92016, 150750, -284532, 0, 0, -569064, -284532, -284532, -228844, -13922, 201000, -201000, 13922, 228844, 284532, 284532, 569064, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| [1, 1, 1, 0, 0, 0] | (0, -11381280, 0, 0, 0, 11381280, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2300624, 0, 0, 0, -847504, 3160312, 5158128, 0, 0, 0, -5158128, -3160312, 847504, 0, 0, 0, 2300624, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -11381280, 0, 0, -847504, -4007816, -2010000, 0, 0, 0, 0, 0, 4221000, 4221000, 0, 0, 0, 0, 0, -2010000, -4007816, -847504, 0, 0, -11381280, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -5158128, -1997816, 2010000, 0, 0, 0, 0, 2010000, -1997816, -5158128, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11381280, 0, 0, 2300624, 2300624, 0, 0, 11381280, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| [1, 1, 2, 0, 0, 0] | (0, 136575360, 0, -40972608, 0, -204863040, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27607488, 0, 0, 0, -10316256, -28275744, -45420768, 0, 0, 0, 100082304, 55214976, 120453792, 0, 0, 0, -65385024, -52312320, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 136575360, 0, 0, -10316256, 17959488, 814464, 0, 0, 0, 0, 0, -140052528, -140052528, -47425536, 0, 0, 0, 0, 351995040, 13417584, -41170416, 0, 0, 1592608032, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -40972608, 0, 0, 100082304, 44867328, 110106144, 0, 0, 0, 0, -351995040, -338577456, -283989456, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -204863040, 0, 0, -65385024, -13072704, 0, 0, -1592608032, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| [1, 1, 3, 1, 1, 1] | (0, 0, -59182656, -54630144, 45525120, -500776320, -2663219520, 0, 0, 0, 0, -29591328, -29591328, -27315072, -27315072, 22762560, 22762560, -250388160, -250388160, -1331609760, -1331609760, 0, 0, 0, 0, -22351888, -23799776, -13755008, -32125168, -23175024, 7148992, -2803536, 16699520, 118203696, 123175552, -76762720, 269823776, -80392832, -467989920, -127571392, -904968720, -2952349920, 0, 0, 0, 0, -22351888, -20904000, 0, -29229392, -29229392, -21105000, -20632512, -13755008, -733512, 13668000, 25519152, 69955848, 120144032, 10050000, 190963080, 246706160, 6419888, -36180000, 393354384, -18984448, -473158800, -66163008, -1715338800, -3762720000, 0, 0, 29591328, -13755008, 18370160, 27320304, -20632512, -6877504, 6143992, 4763976, 0, 36801312, 36801312, -105292608, -255966456, -123565976, -347694880, -360364080, -442194048, -630600032, -644929408, -870381168, -1249368192, -2992892496, 59182656, 29591328, 2276256, -7148992, -9952528, -29455584, -25519152, 44436696, -5751488, -166033704, -255966456, -132400480, -356529384, -567989088, 0, -330430096, -330430096, -38252784, -182957088, -1028409024, -54630144, -27315072, -50077632, 118203696, -4971856, -204910128, 190963080, -55743080, -296029352, -493715736, 442194048, -188405984, -174076608, -38252784, 144704304, 0, -45525120, -22762560, -273150720, -269823776, -350216608, 37380480, -393354384, -412338832, 41835520, -870381168, 378987024, 1028409024, -500776320, -250388160, 1081221600, -127571392, 777397328, -66163008, 1649175792, 2992892496, 2663219520, 1331609760, 2952349920, 3762720000)                                                                                                                                                                                                                                 |
| [2, 2, 2, 2, 2, 2] | (-7803578880, 1818344448, -7085967744, 0, 7085967744, -1818344448, 7803578880, -3901789440, -3901789440, 909172224, 909172224, -3542983872, -3542983872, 0, 0, 3542983872, 3542983872, -909172224, -909172224, 3901789440, 3901789440, 3901789440, 0, 3510365184, -1300596480, -13482330272, -10974222400, 2876637184, -8782978528, -12889007232, 6304455104, 0, -6304455104, 12889007232, 8782978528, -2876637184, 10974222400, 13482330272, 1300596480, -3510365184, 0, -3901789440, 7803578880, 3901789440, 4810961664, 1300596480, -12181733792, -14689841664, 0, -12498597792, -12498597792, -19333510848, 3860369664, -3859259040, -6444503616, -11228174592, 11228174592, 6444503616, 3859259040, -3860369664, 19333510848, 12498597792, 12498597792, 0, 14689841664, 12181733792, -1300596480, -4810961664, -3901789440, -7803578880, 1818344448, 909172224, 4452156096, 2876637184, 11659615712, 7553587008, 3860369664, 7719628704, 5134384128, 7332810528, 0, 2862365568, 2862365568, 0, 7332810528, 5134384128, 7719628704, 3860369664, 7553587008, 11659615712, 2876637184, 4452156096, 909172224, 1818344448, 7085967744, 3542983872, 3542983872, -6304455104, -6304455104, 0, -11228174592, -4783670976, -2198426400, -7332810528, 7332810528, 2198426400, 4783670976, 11228174592, 0, 6304455104, 6304455104, -3542983872, -3542983872, -7085967744, 0, 0, -3542983872, 12889007232, 4106028704, -7553587008, 19333510848, 6834913056, 6834913056, 19333510848, -7553587008, 4106028704, 12889007232, -3542983872, 0, 0, -7085967744, -3542983872, -4452156096, -10974222400, 2508107872, 14689841664, -14689841664, -2508107872, 10974222400, 4452156096, 3542983872, 7085967744, -1818344448, -909172224, -4810961664, -3510365184, -3510365184, -4810961664, -909172224, -1818344448, -7803578880, -3901789440, 3901789440, 7803578880) |
| [1, 3, 3, 2, 0, 0] | (19666851840, 21852057600, 48693668352, 0, -48693668352, -21852057600, -19666851840, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -35695088640, -25079777280, -14102283264, -49340102400, 20862167296, 14857491200, 21413193216, 25596181248, 16119694080, 1211270912, 0, -1211270912, -16119694080, -25596181248, -21413193216, -14857491200, -20862167296, 49340102400, 14102283264, 25079777280, 35695088640, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98137755648, -117282078336, -182967684480, -73761553792, -115199435648, -127305157632, -59258122176, -7206128576, -13473534016, -5967193920, 21015723264, 93336350208, 93336350208, 21015723264, -5967193920, -13473534016, -7206128576, -59258122176, -127305157632, -115199435648, -73761553792, -182967684480, -117282078336, 98137755648, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -621420915456, -216789546816, -84481144896, 628507911168, 474584036608, 732747217152, 836763337152, 893272524608, 893272524608, 836763337152, 732747217152, 474584036608, 628507911168, -84481144896, -216789546816, -621420915456, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1925853497088, -3781608024384, -3212065105344, -2660274810368, -2660274810368, -3212065105344, -3781608024384, -1925853497088, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
| [2, 2, 2, 0, 0, 0] | (0, 307607388672, 0, 0, 0, -307607388672, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -506291281664, 0, 0, 0, -32835262464, 202747214208, 304604047104, 0, 0, 0, -304604047104, -202747214208, 32835262464, 0, 0, 0, 506291281664, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 307607388672, 0, 0, -32835262464, -235582476672, -133725643776, 0, 0, 0, 0, 0, 292753853952, 292753853952, 0, 0, 0, 0, 0, -133725643776, -235582476672, -32835262464, 0, 0, 307607388672, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -304604047104, -101856832896, 133725643776, 0, 0, 0, 0, 133725643776, -101856832896, -304604047104, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -307607388672, 0, 0, 506291281664, 506291281664, 0, 0, -307607388672, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |

* Hecke eigenforms
The characteristic polynomial of =T(2)= is given as follows.
#+BEGIN_SRC sage :exports results
  S16_13_7.hecke_charpoly_tp(2).factor()
#+END_SRC

#+RESULTS:
: (x - 78192) * (x + 1728)

Let =G1 = (32539262976*F1 + 252907706779*F2)/(2^21 * 3^9 * 5^2 * 7^3 * 1070519748223)= and
=G2 = (441367252992*F1 + 1352603388073*F2)/(2^20 * 3^9 * 5^2 * 7^4 * 1070519748223)=.
Then =G1= and =G2= are eigenforms.
The eigenvalue of =G1= (resp. =G2=) is =-1728= (resp. =78192=).

Fourier coefficients of =G1= is given in [[file:g1.csv]].
Fourier coefficients of =G2= is given in [[file:g2.csv]].


#+BEGIN_SRC sage  :exports none
  f16_13_7_0 = dict_sum([32539262976, 252907706779], S16_13_7.basis)
  f16_13_7_1 = dict_sum([441367252992, 1352603388073], S16_13_7.basis)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sage :exports none
  c16_13_7_0 = vec_dict_gcd(f16_13_7_0); factor(c16_13_7_0)
  c16_13_7_1 = vec_dict_gcd(f16_13_7_1); factor(c16_13_7_1)
#+END_SRC

#+RESULTS:
: 2^21 * 3^9 * 5^2 * 7^3 * 1070519748223
: 2^20 * 3^9 * 5^2 * 7^4 * 1070519748223


# (progn (re-search-forward "|") (org-table-export "./g1.csv" "orgtbl-to-csv"))
#+BEGIN_SRC sage :results table :exports none
  [(half_int_mat_to_list(t), f16_13_7_0[t].vector/c16_13_7_0) for t in ts16_13_7]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, -32, 0, 32, 0, 0, 0, 0, 0, 0, -16, -16, 0, 0, 16, 16, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, -4, 6, -8, 0, 8, -6, 4, 0, 0, -4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 8, 0, 4, 4, 9, 0, 0, 3, 4, -4, -3, 0, 0, -9, -4, -4, 0, -8, -4, 0, 0, 0, 0, 0, 0, 16, 0, 4, 14, 0, 0, 3, 5, 0, -2, -2, 0, 5, 3, 0, 0, 14, 4, 0, 16, 0, 0, 32, 16, 16, 8, 8, 0, 4, 1, -2, -5, 5, 2, -1, -4, 0, -8, -8, -16, -16, -32, 0, 0, -16, -6, -10, -14, -9, -5, -5, -9, -14, -10, -6, -16, 0, 0, -32, -16, -16, 0, -4, -8, 8, 4, 0, 16, 16, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| [1, 1, 1, 0, 0, 0] | (0, -640, 0, 0, 0, 640, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 128, 0, 0, 0, -112, -144, -96, 0, 0, 0, 96, 144, 112, 0, 0, 0, -128, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -640, 0, 0, -112, 32, 80, 0, 0, 0, 0, 0, -168, -168, 0, 0, 0, 0, 0, 80, 32, -112, 0, 0, -640, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 96, -48, -80, 0, 0, 0, 0, -80, -48, 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 640, 0, 0, -128, -128, 0, 0, 640, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| [1, 1, 2, 0, 0, 0] | (0, 7680, 0, -2304, 0, -11520, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1536, 0, 0, 0, 192, 1344, 1152, 0, 0, 0, -2016, -3072, -3264, 0, 0, 0, 1728, 8640, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7680, 0, 0, 192, -1152, -1344, 0, 0, 0, 0, 0, 0, 0, 576, 0, 0, 0, 0, 5664, -11136, -36288, 0, 0, 1536, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2304, 0, 0, -2016, 1056, 864, 0, 0, 0, 0, -5664, -16800, 8352, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -11520, 0, 0, 1728, -6912, 0, 0, -1536, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| [1, 1, 3, 1, 1, 1] | (0, 0, -3328, -3072, 2560, -28160, -149760, 0, 0, 0, 0, -1664, -1664, -1536, -1536, 1280, 1280, -14080, -14080, -74880, -74880, 0, 0, 0, 0, 416, 0, 256, -288, 48, -576, -1200, 64, -6672, -3008, -4960, -9792, -8896, -24000, -96, -31200, 74880, 0, 0, 0, 0, 416, 832, 0, 544, 544, 840, 384, 256, -408, -544, -32, -3768, -3616, -400, -9240, -8544, -4336, 1440, -15328, -1904, -5760, 6896, 43680, 149760, 0, 0, 1664, 256, 544, 880, 384, 128, -536, -1064, 0, -3760, -3760, 256, -20088, -12424, -4560, 2320, -25136, -3392, 1696, -26128, 1744, -40128, 3328, 1664, 128, 576, -624, -1888, 32, -3736, -3888, -824, -20088, -7664, 200, 1184, 0, 14208, 14208, 9392, 13184, -14592, -3072, -1536, -2816, -6672, -3664, -5616, -9240, -696, 3512, 1944, 25136, 21744, 16656, 9392, -3792, 0, -2560, -1280, -15360, 9792, 896, 16000, 15328, 13424, 17280, -26128, -27872, 14592, -28160, -14080, 60800, -96, 31104, 6896, -36784, 40128, 149760, 74880, -74880, -149760)                                                                                                                                                                                                                                           |
| [2, 2, 2, 2, 2, 2] | (-1105920, -638976, -182272, 0, 182272, 638976, 1105920, -552960, -552960, -319488, -319488, -91136, -91136, 0, 0, 91136, 91136, 319488, 319488, 552960, 552960, 552960, 0, 49152, -184320, -156416, -69632, -217088, -115968, -114816, 26112, 0, -26112, 114816, 115968, 217088, 69632, 156416, 184320, -49152, 0, -552960, 1105920, 552960, 233472, 184320, 27904, -58880, 0, -105216, -105216, -172224, -165888, -57344, -57408, -84736, 84736, 57408, 57344, 165888, 172224, 105216, 105216, 0, 58880, -27904, -184320, -233472, -552960, -1105920, -638976, -319488, -228352, -217088, -101120, -99968, -165888, -108544, -108608, -81344, 0, -129664, -129664, 0, -81344, -108608, -108544, -165888, -99968, -101120, -217088, -228352, -319488, -638976, 182272, 91136, 91136, -26112, -26112, 0, -84736, -27328, -27264, 81344, -81344, 27264, 27328, 84736, 0, 26112, 26112, -91136, -91136, -182272, 0, 0, -91136, 114816, -1152, 99968, 172224, 67008, 67008, 172224, 99968, -1152, 114816, -91136, 0, 0, -182272, -91136, 228352, -69632, 86784, 58880, -58880, -86784, 69632, -228352, 91136, 182272, 638976, 319488, -233472, -49152, -49152, -233472, 319488, 638976, -1105920, -552960, 552960, 1105920) |
| [1, 3, 3, 2, 0, 0] | (1105920, 1228800, 2738176, 0, -2738176, -1228800, -1105920, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1105920, 368640, 442368, 783360, -200192, -1567744, 357888, -754688, -1585920, 276480, 0, -276480, 1585920, 754688, -357888, 1567744, 200192, -783360, -442368, -368640, -1105920, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7593984, -918528, -7053312, -5764096, -4911104, -9201408, -3641088, -3468544, -3672320, -4040448, 1687040, 518912, 518912, 1687040, -4040448, -3672320, -3468544, -3641088, -9201408, -4911104, -5764096, -7053312, -918528, 7593984, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -33758208, -13971456, -8893440, 27563520, 7000576, 24871424, 58056960, 26386688, 26386688, 58056960, 24871424, 7000576, 27563520, -8893440, -13971456, -33758208, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33401856, -47387392, -7244032, -37313024, -37313024, -7244032, -47387392, 33401856, 0, 0, 0, 0)                                                                                                                                                                                                                                    |
| [2, 2, 2, 0, 0, 0] | (0, 2646016, 0, 0, 0, -2646016, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -22536192, 0, 0, 0, 488448, 3705856, 3655680, 0, 0, 0, -3655680, -3705856, -488448, 0, 0, 0, 22536192, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2646016, 0, 0, 488448, -3217408, -3267584, 0, 0, 0, 0, 0, 806400, 806400, 0, 0, 0, 0, 0, -3267584, -3217408, 488448, 0, 0, 2646016, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -3655680, 50176, 3267584, 0, 0, 0, 0, 3267584, 50176, -3655680, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2646016, 0, 0, 22536192, 22536192, 0, 0, -2646016, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |

# (progn (re-search-forward "|") (org-table-export "./g2.csv" "orgtbl-to-csv"))
#+BEGIN_SRC sage :results table :exports none
  [(half_int_mat_to_list(t), f16_13_7_1[t].vector/c16_13_7_1) for t in ts16_13_7]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, 60, 0, -60, 0, 0, 0, 0, 0, 0, 30, 30, 0, 0, -30, -30, 0, 0, 0, 0, 0, 0, 0, 0, 85, 74, 0, 63, 72, -22, 0, 22, -72, -63, 0, -74, -85, 0, 0, 0, 0, 0, 0, 0, 0, 85, 96, 0, 85, 85, 108, 0, 37, 36, 48, -48, -36, -37, 0, -108, -85, -85, 0, -96, -85, 0, 0, 0, 0, 0, 0, -30, 0, -63, -54, 0, -37, -38, -51, 0, -24, -24, 0, -51, -38, -37, 0, -54, -63, 0, -30, 0, 0, -60, -30, -30, 22, 22, 0, 48, 12, 13, 51, -51, -13, -12, -48, 0, -22, -22, 30, 30, 60, 0, 0, 30, -72, -9, 54, -108, -23, -23, -108, 54, -9, -72, 30, 0, 0, 60, 30, 30, 74, -11, -96, 96, 11, -74, -30, -30, -60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| [1, 1, 1, 0, 0, 0] | (0, 1200, 0, 0, 0, -1200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1240, 0, 0, 0, -160, -1580, -2040, 0, 0, 0, 2040, 1580, 160, 0, 0, 0, -1240, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1200, 0, 0, -160, 1420, 960, 0, 0, 0, 0, 0, -2016, -2016, 0, 0, 0, 0, 0, 960, 1420, -160, 0, 0, 1200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2040, 460, -960, 0, 0, 0, 0, -960, 460, 2040, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1200, 0, 0, -1240, -1240, 0, 0, -1200, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| [1, 1, 2, 0, 0, 0] | (0, -14400, 0, 4320, 0, 21600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -14880, 0, 0, 0, 4080, 14352, 19152, 0, 0, 0, -40176, -29760, -51600, 0, 0, 0, 27840, 50400, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -14400, 0, 0, 4080, -10272, -5472, 0, 0, 0, 0, 0, 45288, 45288, 17568, 0, 0, 0, 0, -91872, -47496, -127320, 0, 0, -509040, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4320, 0, 0, -40176, -10416, -32256, 0, 0, 0, 0, 91872, 44376, 124200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21600, 0, 0, 27840, -22560, 0, 0, 509040, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |
| [1, 1, 3, 1, 1, 1] | (0, 0, 6240, 5760, -4800, 52800, 280800, 0, 0, 0, 0, 3120, 3120, 2880, 2880, -2400, -2400, 26400, 26400, 140400, 140400, 0, 0, 0, 0, 8840, 7696, 5440, 9272, 7680, -4544, -3744, -5152, -64080, -51488, 5600, -125200, -8480, 58320, 40880, 171720, 1244880, 0, 0, 0, 0, 8840, 9984, 0, 11560, 11560, 10080, 8160, 5440, -1344, -6528, -8376, -37224, -52864, -4800, -97560, -112888, -18880, 17280, -186600, -1240, 130680, 48120, 723960, 1797120, 0, 0, -3120, 5440, -3832, -5424, 8160, 2720, -4064, -5664, 0, -26472, -26472, 35040, 4920, -8192, 94760, 125520, 45576, 190768, 215120, 180192, 410760, 812280, -6240, -3120, -240, 4544, 800, 2208, 8376, -28848, -13208, 50496, 4920, 13112, 116064, 188256, 0, 161912, 161912, 48768, 110256, 276000, 5760, 2880, 5280, -64080, -12592, 44496, -97560, 15328, 109336, 167184, -45576, 145192, 120840, 48768, -61488, 0, 4800, 2400, 28800, 125200, 116720, 49920, 186600, 185360, 53440, 180192, -230568, -276000, 52800, 26400, -114000, 40880, -130840, 48120, -675840, -812280, -280800, -140400, -1244880, -1797120)                                                                                                                                                                                                                                                                                                   |
| [2, 2, 2, 2, 2, 2] | (-1762560, -3064320, 1584960, 0, -1584960, 3064320, 1762560, -881280, -881280, -1532160, -1532160, 792480, 792480, 0, 0, -792480, -792480, 1532160, 1532160, 881280, 881280, 881280, 0, -944640, -293760, 3753520, 3278816, -1771520, 2390672, 3722880, -1937440, 0, 1937440, -3722880, -2390672, 1771520, -3278816, -3753520, 293760, 944640, 0, -881280, 1762560, 881280, -650880, 293760, 4047280, 4521984, 0, 3633840, 3633840, 5584320, -1891200, 1025712, 1861440, 3302400, -3302400, -1861440, -1025712, 1891200, -5584320, -3633840, -3633840, 0, -4521984, -4047280, -293760, 650880, -881280, -1762560, -3064320, -1532160, -2324640, -1771520, -4162192, -2829984, -1891200, -2916912, -2081184, -2686416, 0, -1428096, -1428096, 0, -2686416, -2081184, -2916912, -1891200, -2829984, -4162192, -1771520, -2324640, -1532160, -3064320, -1584960, -792480, -792480, 1937440, 1937440, 0, 3302400, 1440960, 605232, 2686416, -2686416, -605232, -1440960, -3302400, 0, -1937440, -1937440, 792480, 792480, 1584960, 0, 0, 792480, -3722880, -1332208, 2829984, -5584320, -1950480, -1950480, -5584320, 2829984, -1332208, -3722880, 792480, 0, 0, 1584960, 792480, 2324640, 3278816, -474704, -4521984, 4521984, 474704, -3278816, -2324640, -792480, -1584960, 3064320, 1532160, 650880, 944640, 944640, 650880, 1532160, 3064320, -1762560, -881280, 881280, 1762560) |
| [1, 3, 3, 2, 0, 0] | (-2073600, -2304000, -5134080, 0, 5134080, 2304000, 2073600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15828480, 9538560, 6274560, 18990720, -7521920, -10880128, -5537280, -11201664, -11358720, 679808, 0, -679808, 11358720, 11201664, 5537280, 10880128, 7521920, -18990720, -6274560, -9538560, -15828480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2304000, 34365120, 31830336, 1513280, 18218560, 5506176, 5051040, -11112032, -9875104, -13729056, -257664, -28170624, -28170624, -257664, -13729056, -9875104, -11112032, 5051040, 5506176, 18218560, 1513280, 31830336, 34365120, -2304000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 70116480, 15956064, -7148064, -96415488, -126333056, -140555904, -45581472, -186591712, -186591712, -45581472, -140555904, -126333056, -96415488, -7148064, 15956064, 70116480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 752200320, 1039188960, 1010593440, 715632640, 715632640, 1010593440, 1039188960, 752200320, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                          |
| [2, 2, 2, 0, 0, 0] | (0, -89214720, 0, 0, 0, 89214720, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 76378240, 0, 0, 0, 12510720, -51199296, -84330624, 0, 0, 0, 84330624, 51199296, -12510720, 0, 0, 0, -76378240, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -89214720, 0, 0, 12510720, 63710016, 30578688, 0, 0, 0, 0, 0, -91540992, -91540992, 0, 0, 0, 0, 0, 30578688, 63710016, 12510720, 0, 0, -89214720, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 84330624, 33131328, -30578688, 0, 0, 0, 0, -30578688, 33131328, 84330624, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 89214720, 0, 0, -76378240, -76378240, 0, 0, 89214720, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |


The euler factors of spinor L function at =2= are given as follows.
#+BEGIN_SRC sage :exports results
  spl2_16_13_7_0 = spinor_l_euler_factor(2, f16_13_7_0)
  spl2_16_13_7_1 = spinor_l_euler_factor(2, f16_13_7_1)
  spl2_16_13_7_0.factor()
  spl2_16_13_7_1.factor()
#+END_SRC

#+RESULTS:
: (-1 + 32768*t)^2 * (1 + 56320*t + 1073741824*t^2) * (1 + 10944*t - 1419640832*t^2 + 11751030521856*t^3 + 1152921504606846976*t^4)
: (-1 + 32768*t)^2 * (1 - 12656*t + 1446889472*t^2 - 7972541431808*t^3 + 1553585740791676928*t^4 - 14591374562304255328256*t^5 + 1237940039285380274899124224*t^6)

=G1= is a conjectural lift of Conjecture 7.7 (i) for =f= of weight 12, =g= of weight 20 and =h= of weight 12.

#+BEGIN_SRC sage :exports none
  f12 = CuspForms(1, 12).basis()[0]
  f20 = CuspForms(1, 20).basis()[0]
  rankin_convolution_degree1(f12, f20, 2).factor()
  rankin_convolution_degree1(f12, f12, 2, a=4).factor()
#+END_SRC

#+RESULTS:
: 1 + 10944*t - 1419640832*t^2 + 11751030521856*t^3 + 1152921504606846976*t^4
: (-1 + 32768*t)^2 * (1 + 56320*t + 1073741824*t^2)


#+BEGIN_SRC sage :exports none
  print factor_latex(spl2_16_13_7_0)
  print factor_latex(spl2_16_13_7_1)
#+END_SRC

#+RESULTS:
: \left(1 - 2^{15} t\right)^{2}\left(1 + 2^{10} \cdot 5 \cdot 11 t + 2^{30} t^{2}\right)\left(1 + 2^{6} \cdot 3^{2} \cdot 19 t - 2^{17} \cdot 10831 t^{2} + 2^{36} \cdot 3^{2} \cdot 19 t^{3} + 2^{60} t^{4}\right)
: \left(1 - 2^{15} t\right)^{2}\left(1 - 2^{4} \cdot 7 \cdot 113 t + 2^{11} \cdot 7 \cdot 100927 t^{2} - 2^{23} \cdot 950401 t^{3} + 2^{41} \cdot 7 \cdot 100927 t^{4} - 2^{64} \cdot 7 \cdot 113 t^{5} + 2^{90} t^{6}\right)

#+BEGIN_SRC sage :exports none
  print factor_latex(from_spinor_to_standard_l(spl2_16_13_7_0))
  print factor_latex(from_spinor_to_standard_l(spl2_16_13_7_1))
#+END_SRC

#+RESULTS:
: \left(1 -  t\right)\left(1 + 2^{-5} \cdot 5 \cdot 11 t +  t^{2}\right)\left(1 + 2^{-9} \cdot 3^{2} \cdot 19 t - 2^{-13} \cdot 10831 t^{2} + 2^{-9} \cdot 3^{2} \cdot 19 t^{3} +  t^{4}\right)
: \left(1 -  t\right)\left(1 - 2^{-11} \cdot 7 \cdot 113 t + 2^{-19} \cdot 7 \cdot 100927 t^{2} - 2^{-22} \cdot 950401 t^{3} + 2^{-19} \cdot 7 \cdot 100927 t^{4} - 2^{-11} \cdot 7 \cdot 113 t^{5} +  t^{6}\right)

#+BEGIN_SRC sage :exports none
  factorization_normalized(from_spinor_to_standard_l(spl2_16_13_7_0))
  factorization_normalized(from_spinor_to_standard_l(spl2_16_13_7_1))
#+END_SRC

#+RESULTS:
: (1 - t) * (1 + 55/32*t + t^2) * (1 + 171/512*t - 10831/8192*t^2 + 171/512*t^3 + t^4)
: (1 - t) * (1 - 791/2048*t + 706489/524288*t^2 - 950401/4194304*t^3 + 706489/524288*t^4 - 791/2048*t^5 + t^6)


* Congruence
Fourier coefficients and Hecke eigenvalues of =G1= and =15*G2= are congruent modulo =37=.
#+BEGIN_SRC sage :exports none
  f16_13_7_0[T0].vector.change_ring(FiniteField(37))
#+END_SRC

#+RESULTS:
: (0, 0, 33, 0, 4, 0, 0, 0, 0, 0, 0, 35, 35, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 19, 0, 0, 18, 10, 36, 0, 1, 27, 19, 0, 0, 18, 0, 0, 0, 0, 0, 0, 0, 0, 19, 1, 0, 19, 19, 15, 0, 0, 5, 19, 18, 32, 0, 0, 22, 18, 18, 0, 36, 18, 0, 0, 0, 0, 0, 0, 2, 0, 19, 11, 0, 0, 5, 33, 0, 9, 9, 0, 33, 5, 0, 0, 11, 19, 0, 2, 0, 0, 4, 2, 2, 1, 1, 0, 19, 14, 9, 4, 33, 28, 23, 18, 0, 36, 36, 35, 35, 33, 0, 0, 35, 27, 8, 26, 22, 4, 4, 22, 26, 8, 27, 35, 0, 0, 33, 35, 35, 0, 18, 36, 1, 19, 0, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
